[
    {
        "title": "Wicked",
        "startYear": 2024,
        "id": "tt1262426",
        "averageRating": 8.1,
        "description": "Elphaba, a misunderstood young woman because of her green skin, and Glinda, a popular girl, become friends at Shiz University in the Land of Oz. After an encounter with the Wonderful Wizard of Oz, their friendship reaches a crossroads.",
        "genres": [
            "Fantasy",
            "Musical",
            "Romance"
        ]
    },
    {
        "title": "Gladiator II",
        "startYear": 2024,
        "id": "tt9218128",
        "averageRating": 6.9,
        "description": "After his home is conquered by the tyrannical emperors who now lead Rome, Lucius is forced to enter the Colosseum and must look to his past to find strength to return the glory of Rome to its people.",
        "genres": [
            "Action",
            "Adventure",
            "Drama"
        ]
    },
    {
        "title": "Moana 2",
        "startYear": 2024,
        "id": "tt13622970",
        "averageRating": 7.1,
        "description": "After receiving an unexpected call from her wayfinding ancestors, Moana must journey to the far seas of Oceania and into dangerous, long-lost waters for an adventure unlike anything she's ever faced.",
        "genres": [
            "Adventure",
            "Animation",
            "Comedy"
        ]
    },
    {
        "title": "Gladiator",
        "startYear": 2000,
        "id": "tt0172495",
        "averageRating": 8.5,
        "description": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
        "genres": [
            "Action",
            "Adventure",
            "Drama"
        ]
    },
    {
        "title": "The Substance",
        "startYear": 2024,
        "id": "tt17526714",
        "averageRating": 7.4,
        "description": "A fading celebrity takes a black-market drug: a cell-replicating substance that temporarily creates a younger, better version of herself.",
        "genres": [
            "Drama",
            "Horror"
        ]
    },
    {
        "title": "Dear Santa",
        "startYear": 2024,
        "id": "tt2396431",
        "averageRating": 5.3,
        "description": "When a young boy mails his Christmas wish list to Santa with one crucial spelling error, a devilish Jack Black arrives to wreak havoc on the holidays.",
        "genres": [
            "Comedy",
            "Fantasy",
            "Horror"
        ]
    },
    {
        "title": "Red One",
        "startYear": 2024,
        "id": "tt14948432",
        "averageRating": 6.8,
        "description": "After Santa Claus is kidnapped, the North Pole's Head of Security must team up with the world's most infamous bounty hunter in a globe-trotting, action-packed mission to save Christmas.",
        "genres": [
            "Action",
            "Adventure",
            "Comedy"
        ]
    },
    {
        "title": "Deadpool & Wolverine",
        "startYear": 2024,
        "id": "tt6263850",
        "averageRating": 7.7,
        "description": "Deadpool is offered a place in the Marvel Cinematic Universe by the Time Variance Authority, but instead recruits a variant of Wolverine to save his universe from extinction.",
        "genres": [
            "Action",
            "Adventure",
            "Comedy"
        ]
    },
    {
        "title": "How to Train Your Dragon",
        "startYear": 2025,
        "id": "tt26743210",
        "averageRating": null,
        "description": "Follows a young Viking as he aspires to hunt dragons, and how he unexpectedly becomes a friend of a young dragon.",
        "genres": [
            "Action",
            "Adventure",
            "Comedy"
        ]
    },
    {
        "title": "Conclave",
        "startYear": 2024,
        "id": "tt20215234",
        "averageRating": 7.4,
        "description": "When Cardinal Lawrence is tasked with leading one of the world's most secretive and ancient events, selecting a new Pope, he finds himself at the center of a conspiracy that could shake the very foundation of the Catholic Church.",
        "genres": null
    }
]